import datetime

import pandas as pd
import pytest


@pytest.fixture
def df():
    return pd.DataFrame({
        "Дата платежа": ["08.06.2021", '09.06.2021', '11.06.2021', '17.06.2021', '14.06.2021'],
        "Сумма операции с округлением": [30.0, 30.0, 23.73, 20.0, 17.0],
        "Категория": ['Связь', 'Частные услуги', 'Одежда и обувь', 'Фастфуд', 'Различные товары'],
        "Описание": ['Devajs Servis.', 'IP Zizov Km', 'Детки', 'IP Yakubovskaya M.V.', 'Детский Мир']

    })


@pytest.fixture
def df2():
    return pd.DataFrame({
        "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*5091"],
        "Дата платежа": ["08.06.2021", '09.06.2021', '11.06.2021', '17.06.2021', '14.06.2021'],
        "Сумма операции с округлением": [30.0, 30.0, 23.73, 20.0, 17.0],
        "Категория": ['Связь', 'Частные услуги', 'Одежда и обувь', 'Фастфуд', 'Различные товары'],
        "Описание": ['Devajs Servis.', 'IP Zizov Km', 'Детки', 'IP Yakubovskaya M.V.', 'Детский Мир']

    })


@pytest.fixture
def df3():
    return pd.DataFrame({
        "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*5091", "*5091"],
        "Дата платежа": ["08.06.2021", "09.06.2021", "11.06.2021", "17.06.2021", "14.06.2021", "19.11.2021"],
        "Сумма операции с округлением": ["30,0", "30,0", "23,73", "20,0", "17,0", "200,00"],
        "Категория": ["Связь", "Частные услуги", "Одежда и обувь", "Фастфуд", "Различные товары", "Мобильная связь"],
        "Описание": ["Devajs Servis.", "IP Zizov Km", "Детки", "IP Yakubovskaya M.V.", "Детский Мир", "Тинькофф "
                                                                                                      "Мобайл +7 995 "
                                                                                                      "555-55-55"]
    })


@pytest.fixture
def df4():
    return pd.DataFrame({
        "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*5091", "*7197"],
        "Дата платежа": ["08.06.2021", '09.06.2021', '11.06.2021', '17.06.2021', '14.06.2021', "01.10.2018"],
        "Сумма операции с округлением": ["30,0", "30.0", "23,73", "20,0", "17,0", "90000,00"],
        "Категория": ['Связь', 'Частные услуги', 'Одежда и обувь', 'Фастфуд', 'Различные товары', "Переводы"],
        "Описание": ['Devajs Servis.', 'IP Zizov Km', 'Детки', 'IP Yakubovskaya M.V.', 'Детский Мир', "Иван С."]

    })


@pytest.fixture
def df5():
    return [
        {
            "Номер карты": "*7197",
            "Дата платежа": "01.10.2018",
            "Сумма операции с округлением": "90000,00",
            "Категория": "Переводы",
            "Описание": "Иван С."
        }
    ]


@pytest.fixture
def df6():
    return pd.DataFrame({
        "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*5091", "*7197", "*5091"],
        "Дата платежа": [datetime.datetime(2021, 6, 11), datetime.datetime(2021, 6, 9),
                         datetime.datetime(2021, 6, 10),  datetime.datetime(2021, 6, 17),
                         datetime.datetime(2021, 6, 14), datetime.datetime(2021, 6, 20),
                         datetime.datetime(2021, 7, 13)],
        "Сумма операции с округлением": [30.5, 30.0, 23.73, 20.0, 17.0, 90000.00, 200.00],
        "Категория": ['Связь', 'Наличные', 'Одежда и обувь', 'Фастфуд', 'Различные товары', "Переводы", "Мобильная связь"],
        "Описание": ['Переводы', 'Снятие денег', 'Детки', 'IP Yakubovskaya M.V.', 'Детский Мир', "Иван С.",
                     "Тинькофф Мобайл +7 995 555-55-55"]

    })


@pytest.fixture
def df7():
    return pd.DataFrame({
        "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*5091", "*7197", "*5091"],
        "Сумма операции с округлением": [30.5, 30.0, 23.73, 20.0, 17.0, 90000.00, 200.00],
        "Категория": ['Связь', 'Наличные', 'Одежда и обувь', 'Фастфуд', 'Различные товары', "Переводы", "Мобильная связь"],
        "Описание": ['Переводы', 'Снятие денег', 'Детки', 'IP Yakubovskaya M.V.', 'Детский Мир', "Иван С.",
                     "Тинькофф Мобайл +7 995 555-55-55"]

    })


@pytest.fixture
def df8():
    return [
        {
            "Номер карты":"*7197",
            "Сумма операции с округлением":90000.0,
            "Категория":"Переводы",
            "Описание":"Иван С."
        }
    ]

# return pd.DataFrame({
#         "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*5091", "*5091"],
#         "Дата платежа": ["08.06.2021", "09.06.2021", "11.06.2021", "17.06.2021", "14.06.2021", "19.11.2021"],
#         "Сумма операции с округлением": ["30,0", "30,0", "23,73", "20,0", "17,0", "200,00"],
#         "Категория": ["Связь", "Частные услуги", "Одежда и обувь", "Фастфуд", "Различные товары", "Мобильная связь"],
#         "Описание": ["Devajs Servis.", "IP Zizov Km", "Детки", "IP Yakubovskaya M.V.", "Детский Мир", "Тинькофф "
#                                                                                                       "Мобайл +7 995 "
#                                                                                                       "555-55-55"]
#     })


@pytest.fixture
def date_time():
    return "20.06.2021"


@pytest.fixture
def time():
    return datetime.datetime(year=2025, month=5, day=1, hour=18, minute=30, second=00)

@pytest.fixture
def category():
    return "Фастфуд"
