import datetime

import pandas as pd
import pytest


@pytest.fixture
def df():
    return pd.DataFrame({
        "Дата платежа": ["08.06.2021", '09.06.2021', '11.06.2021', '17.06.2021', '14.06.2021'],
        "Сумма операции с округлением": [30.0, 30.0, 23.73, 20.0, 17.0],
        "Категория": ['Связь', 'Частные услуги', 'Одежда и обувь', 'Фастфуд', 'Различные товары'],
        "Описание": ['Devajs Servis.', 'IP Zizov Km', 'Детки', 'IP Yakubovskaya M.V.', 'Детский Мир']

    })


@pytest.fixture
def df2():
    return pd.DataFrame({
        "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*5091"],
        "Дата платежа": ["08.06.2021", '09.06.2021', '11.06.2021', '17.06.2021', '14.06.2021'],
        "Сумма операции с округлением": ["30,0", "30.0", "23,73", "20,0", "17,0"],
        "Категория": ['Связь', 'Частные услуги', 'Одежда и обувь', 'Фастфуд', 'Различные товары'],
        "Описание": ['Devajs Servis.', 'IP Zizov Km', 'Детки', 'IP Yakubovskaya M.V.', 'Детский Мир', ]

    })


@pytest.fixture
def df3():
    return pd.DataFrame({
        "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*5091", "*5091"],
        "Дата платежа": ["08.06.2021", "09.06.2021", "11.06.2021", "17.06.2021", "14.06.2021", "19.11.2021"],
        "Сумма операции с округлением": ["30,0", "30,0", "23,73", "20,0", "17,0", "200,00"],
        "Категория": ["Связь", "Частные услуги", "Одежда и обувь", "Фастфуд", "Различные товары", "Мобильная связь"],
        "Описание": ["Devajs Servis.", "IP Zizov Km", "Детки", "IP Yakubovskaya M.V.", "Детский Мир", "Тинькофф "
                                                                                                      "Мобайл +7 995 "
                                                                                                      "555-55-55"]
    })


@pytest.fixture
def date_time():
    return "20.06.2021"


@pytest.fixture
def time():
    return datetime.datetime(year=2025, month=5, day=1, hour=18, minute=30, second=00)

