import pandas as pd

from src.services import search_tel, search_name
from tests.conftest import df5


# def test_search_tel(df3):
#
#     # search_tel(df3)
#     assert search_tel(df3) == [
#         {
#             "Номер карты": "*5091",
#             "Дата платежа": "19.11.2021",
#             "Сумма операции с округлением": "200,00",
#             "Категория": "Мобильная связь",
#             "Описание": "Тинькофф Мобайл +7 995 555-55-55"
#         }
#     ]
#     "Количество записей с номерами телефонов: 1 шт"


# def test_search_name(df5):
#     t = pd.DataFrame({
#         "Номер карты": ["*7197", "*7197", "*5091", "*5091", "*5091", "*7197"],
#         "Дата платежа": ["08.06.2021", '09.06.2021', '11.06.2021', '17.06.2021', '14.06.2021', "01.10.2018"],
#         "Сумма операции с округлением": ["30,0", "30.0", "23,73", "20,0", "17,0", "90000,00"],
#         "Категория": ['Связь', 'Частные услуги', 'Одежда и обувь', 'Фастфуд', 'Различные товары', "Переводы"],
#         "Описание": ['Devajs Servis.', 'IP Zizov Km', 'Детки', 'IP Yakubovskaya M.V.', 'Детский Мир', "Иван С."]
#
#     })
#     tt = search_name(t)
#     assert tt == df5
