from src.services import search_tel, search_name


def test_search_tel(df6):
    assert search_tel(df6) == ('[\n    {\n        "Номер карты":"*5091",\n        "Дата платежа":1626134400000,'
                               '\n        "Сумма операции с округлением":200.0,\n        "Категория":"Мобильная '
                               'связь",\n        "Описание":"Тинькофф Мобайл +7 995 555-55-55"\n    }\n]')


def test_search_name(df6):
    assert search_name(df6) == ('[\n    {\n        "Номер карты":"*7197",\n        "Дата платежа":1624147200000,'
                                '\n        "Сумма операции с округлением":90000.0,\n        "Категория":"Переводы",'
                                '\n        "Описание":"Иван С."\n    }\n]')
